## Given Data: Country Citizen

In [2]:
import pandas as pd
import numpy as np

## import the csv file by using '|' as separator

In [10]:
f = pd.read_csv('users.csv',sep='|', index_col='user_id')

## finding the first 20 entries

In [11]:
f.head(20)

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
6         42      M      executive    98101
7         57      M  administrator    91344
8         36      M  administrator    05201
9         29      M        student    01002
10        53      M         lawyer    90703
11        39      F          other    30329
12        28      F          other    06405
13        47      M       educator    29206
14        45      M      scientist    55106
15        49      F       educator    97301
16        21      M  entertainment    10309
17        30      M     programmer    06355
18        35      F          other    37212
19        40      M      librarian    02138
20        42      F      homemaker    95660

## Total number of Citizens

In [12]:
f.shape[0]

943

## Print all the Occupations

In [15]:
f['occupation']

user_id
1         technician
2              other
3             writer
4         technician
5              other
           ...
939          student
940    administrator
941          student
942        librarian
943          student
Name: occupation, Length: 943, dtype: object

## Number of  Occupations found:   (use nunique method)

In [24]:
f.occupation.nunique()

21

## Citizen with Highest Age

In [48]:
f.age.max()

73

## Citizen with least number of ages

In [58]:
f.age.value_counts().tail(5)

11    1
10    1
73    1
66    1
7     1
Name: age, dtype: int64

## People above age 65 and retired

In [61]:
f[(f.age > 65) & (f.occupation == 'retired')]

         age gender occupation zip_code
user_id
349       68      M    retired    61455
481       73      M    retired    37771
573       68      M    retired    48911
860       70      F    retired    48322

## How many students are there ?

In [72]:
students = f[f.occupation == 'student']
len(students)

196